#!/usr/bin/env zsh
#
# .zsh_plugins.txt - antidote plugins file
#
mattmc3/ez-compinit

# Completions
Aloxaf/fzf-tab
BartSte/fzf-help kind:clone
# sunlei/zsh-ssh
Freed-Wu/fzf-tab-source
conda-incubator/conda-zsh-completion kind:fpath

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload

# Keybindings
jeffreytse/zsh-vi-mode kind:clone

# Prompt
romkatv/powerlevel10k

# Utilities
# zshzoo/macos conditional:is-macos
belak/zsh-utils path:utility
romkatv/zsh-bench kind:path

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions

# vim: set ft=bash:
