#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
zsh-users/zsh-completions kind:fpath path:src
sunlei/zsh-ssh
Freed-Wu/fzf-tab-source
conda-incubator/conda-zsh-completion

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor
jeffreytse/zsh-vi-mode

# History
# belak/zsh-utils path:history

mattmc3/ez-compinit
Aloxaf/fzf-tab  # Remove if you don't use fzf

# Prompt
romkatv/powerlevel10k

# Utilities
zshzoo/macos conditional:is-macos
belak/zsh-utils path:utility
romkatv/zsh-bench kind:path
ohmyzsh/ohmyzsh path:plugins/extract

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
# zsh-users/zsh-history-substring-search      # Up/Down to search history

# vim: set ft=bash:
